return {
[1]={name="10元",price=10,reward={{id=10002,num=100},{id=10001,num=1000000}},dec="累计充值达到10元，即可领取。",},
[2]={name="28元",price=28,reward={{id=10002,num=280},{id=10001,num=2800000}},dec="累计充值达到28元，即可领取。",},
[3]={name="58元",price=58,reward={{id=10002,num=580},{id=10001,num=5800000},{id=20008,num=1}},dec="累计充值达到58元，即可领取。",},
[4]={name="88元",price=88,reward={{id=10002,num=880},{id=10001,num=8800000},{id=20008,num=2},{id=20009,num=1}},dec="累计充值达到88元，即可领取。",},
[5]={name="108元",price=108,reward={{id=10002,num=1080},{id=10001,num=32400000},{id=20008,num=5},{id=20009,num=1}},dec="累计充值达到108元，即可领取。",},
}
